/**********************************************************************************************************
 * @文件     PID_control.c
 * @说明     PID文件
 * @作者     YuyingJin
 * @网站     https://yuyingjin0111.github.io/
 * @日期     2018 ~
**********************************************************************************************************/
#include "PID_control.h"
#define DFilter 0.00530516f //30hz频率
/**********************************************************************************************************
*函 数 名: PID_GetP
*功能说明: 比例控制器
*形    参: PID结构体 误差输入
*返 回 值: 输出比例控制
**********************************************************************************************************/
float PID_GetP(PID_t* pid, float error)
{
	if(pid->kP != 0){
    return (float)error * pid->kP;
	}
	return 0;
}

/**********************************************************************************************************
*函 数 名: PID_GetI
*功能说明: 积分控制器
*形    参: PID结构体 误差输入 运行时间间隔
*返 回 值: 输出积分控制
**********************************************************************************************************/
float PID_GetI(PID_t* pid, float error, float dt)
{
	if((pid->kI != 0) && (dt != 0)) 
	{
		pid->integrator += ((float)error * pid->kI) * dt;
		pid->integrator = ConstrainFloat(pid->integrator, -pid->imax, +pid->imax);
		return pid->integrator;
	}
	return 0;
}

/**********************************************************************************************************
*函 数 名: PID_ResetI
*功能说明: 微分项清零
*形    参: PID结构体
*返 回 值: 无
**********************************************************************************************************/
void PID_ResetI(PID_t* pid)
{
	pid->integrator = 0;
}

/**********************************************************************************************************
*函 数 名: PID_GetD
*功能说明: 带低通滤波的微分控制器，避免微分项噪声过大
*形    参: PID结构体 误差输入 运行时间间隔
*返 回 值: 输出微分控制
**********************************************************************************************************/
float PID_GetD(PID_t* pid, float error, float dt)
{
    if ((pid->kD != 0) && (dt != 0))
    {
        float derivative;

        derivative = (error - pid->lastError) / dt;

        derivative = pid->lastDerivative + (dt / ( DFilter + dt)) * (derivative - pid->lastDerivative);

        pid->lastError	= error;
        pid->lastDerivative = derivative;

        return pid->kD * derivative;
    }
    return 0;
}

/**********************************************************************************************************
*函 数 名: PID_GetPI
*功能说明: 比例+积分控制器
*形    参: PID结构体 误差输入 运行时间间隔
*返 回 值: 输出PI控制
**********************************************************************************************************/
float PID_GetPI(PID_t* pid, float error, float dt)
{
    return PID_GetP(pid, error) + PID_GetI(pid, error, dt);
}

/**********************************************************************************************************
*函 数 名: PID_GetPID
*功能说明: 比例+积分+微分控制器
*形    参: PID结构体 误差输入 运行时间间隔
*返 回 值: 输出PID控制
**********************************************************************************************************/
float PID_GetPID(PID_t* pid, float error, float dt)
{
    return PID_GetP(pid, error) + PID_GetI(pid, error, dt) + PID_GetD(pid, error, dt);
}
